GopalSaraf/Practicals/PSDL/include/proc/pic18f46k80.inc
// Register: BRGCON1
#define BRGCON1 BRGCON1
BRGCON1                                  equ 0E43h
// bitfield definitions
BRGCON1_BRP_POSN                         equ 0000h
BRGCON1_BRP_POSITION                     equ 0000h
BRGCON1_BRP_SIZE                         equ 0006h
BRGCON1_BRP_LENGTH                       equ 0006h
BRGCON1_BRP_MASK                         equ 003Fh
BRGCON1_SJW_POSN                         equ 0006h
BRGCON1_SJW_POSITION                     equ 0006h
BRGCON1_SJW_SIZE                         equ 0002h
BRGCON1_SJW_LENGTH                       equ 0002h
BRGCON1_SJW_MASK                         equ 00C0h
BRGCON1_BRP0_POSN                        equ 0000h
BRGCON1_BRP0_POSITION                    equ 0000h
BRGCON1_BRP0_SIZE                        equ 0001h
BRGCON1_BRP0_LENGTH                      equ 0001h
BRGCON1_BRP0_MASK                        equ 0001h
BRGCON1_BRP1_POSN                        equ 0001h
BRGCON1_BRP1_POSITION                    equ 0001h
BRGCON1_BRP1_SIZE                        equ 0001h
BRGCON1_BRP1_LENGTH                      equ 0001h
BRGCON1_BRP1_MASK                        equ 0002h
BRGCON1_BRP2_POSN                        equ 0002h
BRGCON1_BRP2_POSITION                    equ 0002h
BRGCON1_BRP2_SIZE                        equ 0001h
BRGCON1_BRP2_LENGTH                      equ 0001h
BRGCON1_BRP2_MASK                        equ 0004h
BRGCON1_BRP3_POSN                        equ 0003h
BRGCON1_BRP3_POSITION                    equ 0003h
BRGCON1_BRP3_SIZE                        equ 0001h
BRGCON1_BRP3_LENGTH                      equ 0001h
BRGCON1_BRP3_MASK                        equ 0008h
BRGCON1_BRP4_POSN                        equ 0004h
BRGCON1_BRP4_POSITION                    equ 0004h
BRGCON1_BRP4_SIZE                        equ 0001h
BRGCON1_BRP4_LENGTH                      equ 0001h
BRGCON1_BRP4_MASK                        equ 0010h
BRGCON1_BRP5_POSN                        equ 0005h
BRGCON1_BRP5_POSITION                    equ 0005h
BRGCON1_BRP5_SIZE                        equ 0001h
BRGCON1_BRP5_LENGTH                      equ 0001h
BRGCON1_BRP5_MASK                        equ 0020h
BRGCON1_SJW0_POSN                        equ 0006h
BRGCON1_SJW0_POSITION                    equ 0006h
BRGCON1_SJW0_SIZE                        equ 0001h
BRGCON1_SJW0_LENGTH                      equ 0001h
BRGCON1_SJW0_MASK                        equ 0040h
BRGCON1_SJW1_POSN                        equ 0007h
BRGCON1_SJW1_POSITION                    equ 0007h
BRGCON1_SJW1_SIZE                        equ 0001h
BRGCON1_SJW1_LENGTH                      equ 0001h
BRGCON1_SJW1_MASK                        equ 0080h

// Register: BRGCON2
#define BRGCON2 BRGCON2
BRGCON2                                  equ 0E44h
// bitfield definitions
BRGCON2_PRSEG_POSN                       equ 0000h
BRGCON2_PRSEG_POSITION                   equ 0000h
BRGCON2_PRSEG_SIZE                       equ 0003h
BRGCON2_PRSEG_LENGTH                     equ 0003h
BRGCON2_PRSEG_MASK                       equ 0007h
BRGCON2_SEG1PH_POSN                      equ 0003h
BRGCON2_SEG1PH_POSITION                  equ 0003h
BRGCON2_SEG1PH_SIZE                      equ 0003h
BRGCON2_SEG1PH_LENGTH                    equ 0003h
BRGCON2_SEG1PH_MASK                      equ 0038h
BRGCON2_SAM_POSN                         equ 0006h
BRGCON2_SAM_POSITION                     equ 0006h
BRGCON2_SAM_SIZE                         equ 0001h
BRGCON2_SAM_LENGTH                       equ 0001h
BRGCON2_SAM_MASK                         equ 0040h
BRGCON2_SEG2PHTS_POSN                    equ 0007h
BRGCON2_SEG2PHTS_POSITION                equ 0007h
BRGCON2_SEG2PHTS_SIZE                    equ 0001h
BRGCON2_SEG2PHTS_LENGTH                  equ 0001h
BRGCON2_SEG2PHTS_MASK                    equ 0080h
BRGCON2_PRSEG0_POSN                      equ 0000h
BRGCON2_PRSEG0_POSITION                  equ 0000h
BRGCON2_PRSEG0_SIZE                      equ 0001h
BRGCON2_PRSEG0_LENGTH                    equ 0001h
BRGCON2_PRSEG0_MASK                      equ 0001h
BRGCON2_PRSEG1_POSN                      equ 0001h
BRGCON2_PRSEG1_POSITION                  equ 0001h
BRGCON2_PRSEG1_SIZE                      equ 0001h
BRGCON2_PRSEG1_LENGTH                    equ 0001h
BRGCON2_PRSEG1_MASK                      equ 0002h
BRGCON2_PRSEG2_POSN                      equ 0002h
BRGCON2_PRSEG2_POSITION                  equ 0002h
BRGCON2_PRSEG2_SIZE                      equ 0001h
BRGCON2_PRSEG2_LENGTH                    equ 0001h
BRGCON2_PRSEG2_MASK                      equ 0004h
BRGCON2_SEG1PH0_POSN                     equ 0003h
BRGCON2_SEG1PH0_POSITION                 equ 0003h
BRGCON2_SEG1PH0_SIZE                     equ 0001h
BRGCON2_SEG1PH0_LENGTH                   equ 0001h
BRGCON2_SEG1PH0_MASK                     equ 0008h
BRGCON2_SEG1PH1_POSN                     equ 0004h
BRGCON2_SEG1PH1_POSITION                 equ 0004h
BRGCON2_SEG1PH1_SIZE                     equ 0001h
BRGCON2_SEG1PH1_LENGTH                   equ 0001h
BRGCON2_SEG1PH1_MASK                     equ 0010h
BRGCON2_SEG1PH2_POSN                     equ 0005h
BRGCON2_SEG1PH2_POSITION                 equ 0005h
BRGCON2_SEG1PH2_SIZE                     equ 0001h
BRGCON2_SEG1PH2_LENGTH                   equ 0001h
BRGCON2_SEG1PH2_MASK                     equ 0020h
BRGCON2_SEG2PHT_POSN                     equ 0007h
BRGCON2_SEG2PHT_POSITION                 equ 0007h
BRGCON2_SEG2PHT_SIZE                     equ 0001h
BRGCON2_SEG2PHT_LENGTH                   equ 0001h
BRGCON2_SEG2PHT_MASK                     equ 0080h

// Register: BRGCON3
#define BRGCON3 BRGCON3
BRGCON3                                  equ 0E45h
// bitfield definitions
BRGCON3_SEG2PH_POSN                      equ 0000h
BRGCON3_SEG2PH_POSITION                  equ 0000h
BRGCON3_SEG2PH_SIZE                      equ 0003h
BRGCON3_SEG2PH_LENGTH                    equ 0003h
BRGCON3_SEG2PH_MASK                      equ 0007h
BRGCON3_WAKFIL_POSN                      equ 0006h
BRGCON3_WAKFIL_POSITION                  equ 0006h
BRGCON3_WAKFIL_SIZE                      equ 0001h
BRGCON3_WAKFIL_LENGTH                    equ 0001h
BRGCON3_WAKFIL_MASK                      equ 0040h
BRGCON3_WAKDIS_POSN                      equ 0007h
BRGCON3_WAKDIS_POSITION                  equ 0007h
BRGCON3_WAKDIS_SIZE                      equ 0001h
BRGCON3_WAKDIS_LENGTH                    equ 0001h
BRGCON3_WAKDIS_MASK                      equ 0080h
BRGCON3_SEG2PH0_POSN                     equ 0000h
BRGCON3_SEG2PH0_POSITION                 equ 0000h
BRGCON3_SEG2PH0_SIZE                     equ 0001h
BRGCON3_SEG2PH0_LENGTH                   equ 0001h
BRGCON3_SEG2PH0_MASK                     equ 0001h
BRGCON3_SEG2PH1_POSN                     equ 0001h
BRGCON3_SEG2PH1_POSITION                 equ 0001h
BRGCON3_SEG2PH1_SIZE                     equ 0001h
BRGCON3_SEG2PH1_LENGTH                   equ 0001h
BRGCON3_SEG2PH1_MASK                     equ 0002h
BRGCON3_SEG2PH2_POSN                     equ 0002h
BRGCON3_SEG2PH2_POSITION                 equ 0002h
BRGCON3_SEG2PH2_SIZE                     equ 0001h
BRGCON3_SEG2PH2_LENGTH                   equ 0001h
BRGCON3_SEG2PH2_MASK                     equ 0004h

// Register: RXFCON0
#define RXFCON0 RXFCON0
RXFCON0                                  equ 0E46h
// bitfield definitions
RXFCON0_RXF0EN_POSN                      equ 0000h
RXFCON0_RXF0EN_POSITION                  equ 0000h
RXFCON0_RXF0EN_SIZE                      equ 0001h
RXFCON0_RXF0EN_LENGTH                    equ 0001h
RXFCON0_RXF0EN_MASK                      equ 0001h
RXFCON0_RXF1EN_POSN                      equ 0001h
RXFCON0_RXF1EN_POSITION                  equ 0001h
RXFCON0_RXF1EN_SIZE                      equ 0001h
RXFCON0_RXF1EN_LENGTH                    equ 0001h
RXFCON0_RXF1EN_MASK                      equ 0002h
RXFCON0_RXF2EN_POSN                      equ 0002h
RXFCON0_RXF2EN_POSITION                  equ 0002h
RXFCON0_RXF2EN_SIZE                      equ 0001h
RXFCON0_RXF2EN_LENGTH                    equ 0001h
RXFCON0_RXF2EN_MASK                      equ 0004h
RXFCON0_RXF3EN_POSN                      equ 0003h
RXFCON0_RXF3EN_POSITION                  equ 0003h
RXFCON0_RXF3EN_SIZE                      equ 0001h
RXFCON0_RXF3EN_LENGTH                    equ 0001h
RXFCON0_RXF3EN_MASK                      equ 0008h
RXFCON0_RXF4EN_POSN                      equ 0004h
RXFCON0_RXF4EN_POSITION                  equ 0004h
RXFCON0_RXF4EN_SIZE                      equ 0001h
RXFCON0_RXF4EN_LENGTH                    equ 0001h
RXFCON0_RXF4EN_MASK                      equ 0010h
RXFCON0_RXF5EN_POSN                      equ 0005h
RXFCON0_RXF5EN_POSITION                  equ 0005h
RXFCON0_RXF5EN_SIZE                      equ 0001h
RXFCON0_RXF5EN_LENGTH                    equ 0001h
RXFCON0_RXF5EN_MASK                      equ 0020h
RXFCON0_RXF6EN_POSN                      equ 0006h
RXFCON0_RXF6EN_POSITION                  equ 0006h
RXFCON0_RXF6EN_SIZE                      equ 0001h
RXFCON0_RXF6EN_LENGTH                    equ 0001h
RXFCON0_RXF6EN_MASK                      equ 0040h
RXFCON0_RXF7EN_POSN                      equ 0007h
RXFCON0_RXF7EN_POSITION                  equ 0007h
RXFCON0_RXF7EN_SIZE                      equ 0001h
RXFCON0_RXF7EN_LENGTH                    equ 0001h
RXFCON0_RXF7EN_MASK                      equ 0080h

