GopalSaraf/Practicals/PSDL/include/proc/pic18f46k80.inc
// Register: ECANCON
#define ECANCON ECANCON
ECANCON                                  equ 0F72h
// bitfield definitions
ECANCON_EWIN_POSN                        equ 0000h
ECANCON_EWIN_POSITION                    equ 0000h
ECANCON_EWIN_SIZE                        equ 0005h
ECANCON_EWIN_LENGTH                      equ 0005h
ECANCON_EWIN_MASK                        equ 001Fh
ECANCON_FIFOWM_POSN                      equ 0005h
ECANCON_FIFOWM_POSITION                  equ 0005h
ECANCON_FIFOWM_SIZE                      equ 0001h
ECANCON_FIFOWM_LENGTH                    equ 0001h
ECANCON_FIFOWM_MASK                      equ 0020h
ECANCON_MDSEL_POSN                       equ 0006h
ECANCON_MDSEL_POSITION                   equ 0006h
ECANCON_MDSEL_SIZE                       equ 0002h
ECANCON_MDSEL_LENGTH                     equ 0002h
ECANCON_MDSEL_MASK                       equ 00C0h
ECANCON_EWIN0_POSN                       equ 0000h
ECANCON_EWIN0_POSITION                   equ 0000h
ECANCON_EWIN0_SIZE                       equ 0001h
ECANCON_EWIN0_LENGTH                     equ 0001h
ECANCON_EWIN0_MASK                       equ 0001h
ECANCON_EWIN1_POSN                       equ 0001h
ECANCON_EWIN1_POSITION                   equ 0001h
ECANCON_EWIN1_SIZE                       equ 0001h
ECANCON_EWIN1_LENGTH                     equ 0001h
ECANCON_EWIN1_MASK                       equ 0002h
ECANCON_EWIN2_POSN                       equ 0002h
ECANCON_EWIN2_POSITION                   equ 0002h
ECANCON_EWIN2_SIZE                       equ 0001h
ECANCON_EWIN2_LENGTH                     equ 0001h
ECANCON_EWIN2_MASK                       equ 0004h
ECANCON_EWIN3_POSN                       equ 0003h
ECANCON_EWIN3_POSITION                   equ 0003h
ECANCON_EWIN3_SIZE                       equ 0001h
ECANCON_EWIN3_LENGTH                     equ 0001h
ECANCON_EWIN3_MASK                       equ 0008h
ECANCON_EWIN4_POSN                       equ 0004h
ECANCON_EWIN4_POSITION                   equ 0004h
ECANCON_EWIN4_SIZE                       equ 0001h
ECANCON_EWIN4_LENGTH                     equ 0001h
ECANCON_EWIN4_MASK                       equ 0010h
ECANCON_MDSEL0_POSN                      equ 0006h
ECANCON_MDSEL0_POSITION                  equ 0006h
ECANCON_MDSEL0_SIZE                      equ 0001h
ECANCON_MDSEL0_LENGTH                    equ 0001h
ECANCON_MDSEL0_MASK                      equ 0040h
ECANCON_MDSEL1_POSN                      equ 0007h
ECANCON_MDSEL1_POSITION                  equ 0007h
ECANCON_MDSEL1_SIZE                      equ 0001h
ECANCON_MDSEL1_LENGTH                    equ 0001h
ECANCON_MDSEL1_MASK                      equ 0080h

// Register: EEDATA
#define EEDATA EEDATA
EEDATA                                   equ 0F73h
// bitfield definitions
EEDATA_EEDATA_POSN                       equ 0000h
EEDATA_EEDATA_POSITION                   equ 0000h
EEDATA_EEDATA_SIZE                       equ 0008h
EEDATA_EEDATA_LENGTH                     equ 0008h
EEDATA_EEDATA_MASK                       equ 00FFh

// Register: EEADR
#define EEADR EEADR
EEADR                                    equ 0F74h
// bitfield definitions
EEADR_EEADR_POSN                         equ 0000h
EEADR_EEADR_POSITION                     equ 0000h
EEADR_EEADR_SIZE                         equ 0008h
EEADR_EEADR_LENGTH                       equ 0008h
EEADR_EEADR_MASK                         equ 00FFh

// Register: EEADRH
#define EEADRH EEADRH
EEADRH                                   equ 0F75h
// bitfield definitions
EEADRH_EEADRH_POSN                       equ 0000h
EEADRH_EEADRH_POSITION                   equ 0000h
EEADRH_EEADRH_SIZE                       equ 0008h
EEADRH_EEADRH_LENGTH                     equ 0008h
EEADRH_EEADRH_MASK                       equ 00FFh

// Register: PIE5
#define PIE5 PIE5
PIE5                                     equ 0F76h
// bitfield definitions
PIE5_RXB0IE_POSN                         equ 0000h
PIE5_RXB0IE_POSITION                     equ 0000h
PIE5_RXB0IE_SIZE                         equ 0001h
PIE5_RXB0IE_LENGTH                       equ 0001h
PIE5_RXB0IE_MASK                         equ 0001h
PIE5_RXB1IE_POSN                         equ 0001h
PIE5_RXB1IE_POSITION                     equ 0001h
PIE5_RXB1IE_SIZE                         equ 0001h
PIE5_RXB1IE_LENGTH                       equ 0001h
PIE5_RXB1IE_MASK                         equ 0002h
PIE5_TXB0IE_POSN                         equ 0002h
PIE5_TXB0IE_POSITION                     equ 0002h
PIE5_TXB0IE_SIZE                         equ 0001h
PIE5_TXB0IE_LENGTH                       equ 0001h
PIE5_TXB0IE_MASK                         equ 0004h
PIE5_TXB1IE_POSN                         equ 0003h
PIE5_TXB1IE_POSITION                     equ 0003h
PIE5_TXB1IE_SIZE                         equ 0001h
PIE5_TXB1IE_LENGTH                       equ 0001h
PIE5_TXB1IE_MASK                         equ 0008h
PIE5_TXB2IE_POSN                         equ 0004h
PIE5_TXB2IE_POSITION                     equ 0004h
PIE5_TXB2IE_SIZE                         equ 0001h
PIE5_TXB2IE_LENGTH                       equ 0001h
PIE5_TXB2IE_MASK                         equ 0010h
PIE5_ERRIE_POSN                          equ 0005h
PIE5_ERRIE_POSITION                      equ 0005h
PIE5_ERRIE_SIZE                          equ 0001h
PIE5_ERRIE_LENGTH                        equ 0001h
PIE5_ERRIE_MASK                          equ 0020h
PIE5_WAKIE_POSN                          equ 0006h
PIE5_WAKIE_POSITION                      equ 0006h
PIE5_WAKIE_SIZE                          equ 0001h
PIE5_WAKIE_LENGTH                        equ 0001h
PIE5_WAKIE_MASK                          equ 0040h
PIE5_IRXIE_POSN                          equ 0007h
PIE5_IRXIE_POSITION                      equ 0007h
PIE5_IRXIE_SIZE                          equ 0001h
PIE5_IRXIE_LENGTH                        equ 0001h
PIE5_IRXIE_MASK                          equ 0080h
PIE5_FIFOWMIE_POSN                       equ 0000h
PIE5_FIFOWMIE_POSITION                   equ 0000h
PIE5_FIFOWMIE_SIZE                       equ 0001h
PIE5_FIFOWMIE_LENGTH                     equ 0001h
PIE5_FIFOWMIE_MASK                       equ 0001h
PIE5_RXBnIE_POSN                         equ 0001h
PIE5_RXBnIE_POSITION                     equ 0001h
PIE5_RXBnIE_SIZE                         equ 0001h
PIE5_RXBnIE_LENGTH                       equ 0001h
PIE5_RXBnIE_MASK                         equ 0002h
PIE5_TXBnIE_POSN                         equ 0004h
PIE5_TXBnIE_POSITION                     equ 0004h
PIE5_TXBnIE_SIZE                         equ 0001h
PIE5_TXBnIE_LENGTH                       equ 0001h
PIE5_TXBnIE_MASK                         equ 0010h

